app/views/admins/view_account_details.html.erb

			<b><%= "Created at:" %></b> <%= "#{@account.created_at}" %><br>
			<b><%= "Updated at:" %></b> <%= "#{@account.updated_at}" %><br><br>
---
UPDATE "accounts" SET "status" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["status", 2], ["updated_at", 2017-02-22 03:11:11 UTC], ["id", 7]]