app/views/admins/view_transaction_history.html.erb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1  [["account_id", 13]]
---

	<% @account.transactions.each do |transaction| %>

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
				<% transfer = Transfer.find_by(:transaction_id => transaction.id) %>
				<% dest_account = Account.find_by(:id => transfer.account_id) %>