app/controllers/admins_controller.rb

	def view_admins
		session_check
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering view admins page")
		@admins = Admin.all
---
SELECT "admins".* FROM "admins"

	def create_accounts
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering the create accounts(approve request to create) page")
		session_check
		# get all the accounts with status pending(3) // active(1) closed(2)
		@accounts = Account.where(status: 3)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."status" = $1  [["status", 3]]

	def approve_or_decline_account
		logger.info("(#{self.class.to_s}) (#{action_name}) -- approve_or_decline_account page")
		session_check
		@account = Account.find(params[:account_id])
		puts "Admin decision: #{params[:decision]}"
		if params[:decision] == '1'
			@account.status = 1
			@account.save
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "accounts" SET "status" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["status", 1], ["updated_at", 2017-02-22 04:02:24 UTC], ["id", 13]]

	def view_accounts
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering view_accounts page")
		session_check
		@accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

	def view_account_details
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering view_account_details page")
		session_check
		@account = Account.find(params[:id])
		@user = @account.user
		if !params[:decision].nil?
			puts "parameter : #{params[:decision]}"
			if !(1...3).include?(params[:decision].to_i)
				puts "need to redirect"
				redirect_to view_account_details_url(@account)
			else
				puts "no need to redirect"
				@account.status = params[:decision]
				@account.save
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "accounts" SET "status" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["status", 2], ["updated_at", 2017-02-22 03:11:11 UTC], ["id", 7]]

	def view_transaction_history
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering view_transaction history page")
		session_check
		#puts debug(params)
		@account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

	def view_transaction_requests
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering view_transaction_requests page")
		session_check
		@transactions = Transaction.where("status = 3")
---
SELECT "transactions".* FROM "transactions" WHERE (status = 3)

	def approve_or_decline_transaction
		logger.info("(#{self.class.to_s}) (#{action_name}) -- approve_or_decline_transaction page")
		session_check
		puts "params: #{params[:transaction_id]}"
		@transaction = Transaction.find(params[:transaction_id])
		if params[:decision] == '1'
			@transaction.status = 1
			@account = Account.find(@transaction.account_id)
			@account.balance -= @transaction.amount
			@account.save
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 7500.0], ["updated_at", 2017-02-22 05:29:40 UTC], ["id", 13]]
UPDATE "transactions" SET "status" = $1, "updated_at" = $2 WHERE "transactions"."id" = $3  [["status", 1], ["updated_at", 2017-02-22 05:21:50 UTC], ["id", 3]]

	def delete_account
		logger.info("(#{self.class.to_s}) (#{action_name}) -- delete account page")
		session_check
		account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]