app/controllers/admin_controller.rb

	def create
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering the create admin post_request page")
		@user = User.new(params.require(:user).permit(:name, :email, :password, :password_confirmation))
  		if @user.save
			@admin = Admin.create(:predefined => 0, :user_id => @user.id)
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "admins" ("predefined", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["predefined", 0], ["user_id", 16], ["created_at", 2017-02-22 02:12:28 UTC], ["updated_at", 2017-02-22 02:12:28 UTC]]

	def view_admins
		@admins = Admin.all
---
SELECT "admins".* FROM "admins"

	def delete_admin
		logger.info("(#{self.class.to_s}) (#{action_name}) -- destroying an admin")
		Admin.destroy(params[:id])
---
DELETE FROM "admins" WHERE "admins"."id" = $1  [["id", 10]]

	def view_users
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering the view users page")
		@users = User.all
---
SELECT "users".* FROM "users"

	def view_transaction_history
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering the view transaction history page")
		@user = User.find(params[:id])
	    	@accounts = Account.find_by(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 13], ["LIMIT", 1]]

	def create_accounts
		logger.info("(#{self.class.to_s}) (#{action_name}) -- Entering the create accounts(approve request to create) page")
		# get all the accounts with status pending(3) // active(1) closed(2)
		@accounts = Account.where(status: 3)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."status" = $1  [["status", 3]]

	def approve_or_decline_account
		logger.info("(#{self.class.to_s}) (#{action_name}) -- approve_or_decline_account page")
		@account = Account.find(params[:account_id])
		puts "Admin decision: #{params[:decision]}"
		if params[:decision] == '1'
			@account.status = 1
			@account.save
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "accounts" SET "status" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["status", 1], ["updated_at", 2017-02-22 01:38:14 UTC], ["id", 12]]