app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:session][:email].downcase)
    admin = Admin.find_by_user_id(user.id) if !user.nil?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sa@example.com"], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]