app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at DESC
---
    def index
      if params[:search]
        @users = User.search(params[:search]).order("created_at ASC")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Fetch User Information")
      @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Model action to create new user")
      @user = User.find_by_email(params[:email])

      if !@user.nil?
        flash[:success] = "User already exists!"
        redirect_to login_url
      end

      @user = User.new(user_params)
  	  if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Edit User Profile Page")
  	  @user = User.find(params[:id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 1]]
---
    def account
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Account Details Page for current user page")
  	  @user = current_user
      @accounts = Account.where(:user_id => current_user)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "accounts" ("balance", "status", "account_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["balance", 0.0], ["status", 3], ["account_id", 100000000], ["user_id", 1], ["created_at", 2017-02-21 18:42:15 UTC], ["updated_at", 2017-02-21 18:42:15 UTC]]
---
    def account_create_request
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Request to create an account for current user")
      @user = User.find(params[:id])

      account = Account.create(:user_id => @user.id,:balance => 0, :status => 3)

SELECT "users".* FROM "users" WHERE (name ilike '%samuel%' or email ilike '%samuel%') ORDER BY created_at DESC
---
    def search_for_users
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Search for other users")
      if params[:search]
        @users = User.search(params[:search]).order("created_at DESC")

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "friends" ("user_id", "friend_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 1], ["friend_id", 3]]
---
    def add_friend
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Add a friend for current user")
      f = Friend.new
      user_to_add_as_friend = User.find(params[:id].to_i)

      if are_they_friends(current_user,user_to_add_as_friend)
        flash[:danger] = "You are already friends"
      else
        f.user_id = current_user.id
        f.friend_id = user_to_add_as_friend.id
        if f.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = $1  [["user_id", 1]]
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show_friends
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Show firends for the current user page")
      @user = User.find(params[:id])

      if is_same_user?(@user,current_user)
        @friends = Friend.where(:user_id => params[:id])
        @your_friends = []

        @friends.each do |t|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."account_id" = $1 LIMIT $2  [["account_id", 38], ["LIMIT", 1]]
---
  def transfer_money
    logger.info("(#{self.class.to_s}) (#{action_name}) -- Transfer money to a friend")
    @friend = User.find(params[:id])
    @source_accounts = Account.where(:user_id => current_user,:status => 1)
    @destination_accounts = Account.where(:user_id => @friend.id,:status => 1)

    if request.post?
      if !is_number?(params[:amount])
        flash[:danger] = "Incorrect amount format"
        redirect_to account_url
        return
      end


      amount = params[:amount].to_f

      if can_transfer(current_user,@friend,amount)
        source_account = Account.find(params[:source_account_id].to_i)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 AND "accounts"."status" = $1  [["status", 1]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
INSERT INTO "transactions" ("transaction_type", "status", "start", "finish", "amount", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 1.0], ["updated_at", 2017-02-21 15:34:03 UTC], ["id", 38]]
---
    def deposit
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Deposit for the current user account")
      @accounts = Account.where(:user_id => current_user, :status => 1)

      if request.post?
        @account = Account.find(params[:account_id].to_i)

        if !is_number?(params[:amount])
          flash[:danger] = "Incorrect amount format"
          redirect_to account_url
          return
        end

        amount = params[:amount].to_f
        account_id = params[:account_id].to_i
        @Transaction = create_transaction_model(deposit_type, pending_status, amount, account_id)

        if @Transaction.save

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = 1 AND "accounts"."status" = $1  [["status", 1]]
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
INSERT INTO "transactions" ("transaction_type", "status", "start", "finish", "amount", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "accounts" SET "balance" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["balance", 17.0], ["updated_at", 2017-02-21 17:24:10 UTC], ["id", 38]]
---
    def withdraw
      logger.info("(#{self.class.to_s}) (#{action_name}) -- Withdraw for the current user account")
      @accounts = Account.where(:user_id => current_user, :status => 1)

      if request.post?
        @account = Account.find(params[:account_id].to_i)

        if !is_number?(params[:amount])
          flash[:danger] = "Incorrect amount format"
          redirect_to account_url
          return
        end

        withdraw_amount = params[:amount].to_f

        if is_valid_withdraw(@account, withdraw_amount)
          if withdraw_amount >= 1000.0
            account_id = params[:account_id].to_i
            @Transaction = create_transaction_model(withdraw_type, pending_status, withdraw_amount, account_id)

            if @Transaction.save